tap "d12frosted/emacs-plus"
brew "btop"
brew "bottom"
brew "coreutils"
brew "cowsay"
brew "fd"
brew "fortune"
brew "fzf"
brew "gdu"
brew "goenv"
brew "htop"
brew "jq"
brew "lazygit"
brew "libvterm"
brew "node"
brew "nvim"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "watch"
brew "wget"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus@31", args: ["without-cocoa"]
cask "font-blex-mono-nerd-font"
cask "ghostty"
