tap "sst/tap"
tap "tw93/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Library for manipulating PNG images
brew "libpng"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@78"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# LLVM's OpenMP runtime library
brew "libomp"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Improved top (interactive process viewer)
brew "htop"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# Library to render SVG files using Cairo
brew "librsvg"
# GNOME XML library
brew "libxml2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# LLM inference in C/C++
brew "llama.cpp"
# Next-gen compiler infrastructure
brew "llvm"
# Package manager for the Lua programming language
brew "luarocks"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interactive GPU process monitor
brew "nvtop"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Vulnerability scanner which uses the OSV database
brew "osv-scanner"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Show ps output as a tree
brew "pstree"
# Steel Bank Common Lisp system
brew "sbcl"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Tool Command Language
brew "tcl-tk@8", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
cask "font-blex-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
go "github.com/air-verse/air"
go "github.com/mibk/dupl"
go "github.com/kisielk/errcheck"
go "cmd/go"
go "github.com/go-critic/go-critic/cmd/go-critic"
go "github.com/uudashr/gocognit/cmd/gocognit"
go "github.com/jgautheron/goconst/cmd/goconst"
go "github.com/fzipp/gocyclo/cmd/gocyclo"
go "cmd/gofmt"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/vektra/mockery/v3"
go "github.com/alexkohler/nakedret/v2/cmd/nakedret"
go "github.com/sonatard/noctx/cmd/noctx"
go "github.com/mgechev/revive"
go "github.com/gleicon/tldt/cmd/tldt"
uv "pynvim"
uv "ruff"
uv "ty"
npm "@google/gemini-cli"
npm "@openai/codex"
npm "eslint"
npm "http-server"
npm "neovim"
npm "npm-check-updates"
npm "pnpm"
npm "prettier"
npm "tailwindcss"
npm "tsx"
npm "typescript"
